Revit 2026 API

# DirectShapeSetShape(IListGeometryObject) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetShape(
	IList<GeometryObject> pGeomArr
)
```
```vb
Public Sub SetShape (
	pGeomArr As IList(Of GeometryObject)
)
```
```cpp
public:
void SetShape(
	IList<GeometryObject^>^ pGeomArr
)
```
```fsharp
member SetShape :
        pGeomArr : IList<GeometryObject> -> unit
```

#### Parameters

pGeomArr IListGeometryObject

#### Reference

DirectShape Class

SetShape Overload

Autodesk.Revit.DB Namespace